<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 5 changes.</summary>

```diff
~ data.tailscale_devices.devices_list will be read during apply
# (config refers to values not yet known)
+ random_id.tailscale_host_suffix will be created
~ module.coreos-periphery-vm.data.ct_config.fedora-coreos-config will be read during apply
# (config refers to values not yet known)
! module.coreos-periphery-vm.proxmox_virtual_environment_file.cloud_user_config must be replaced
! module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm must be replaced
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 3 to add, 0 to change, 2 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-07-14T05:17:56Z [(view log)](https://github.com/perchnet/p/actions/runs/16258599699/job/45899315357#step:9:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.tailscale_devices.devices_list will be read during apply
  # (config refers to values not yet known)
 <= data "tailscale_devices" "devices_list" {
      + devices     = (known after apply)
      + id          = (known after apply)
      + name_prefix = (known after apply)
    }

  # random_id.tailscale_host_suffix will be created
  + resource "random_id" "tailscale_host_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.coreos-periphery-vm.data.ct_config.fedora-coreos-config will be read during apply
  # (config refers to values not yet known)
 <= data "ct_config" "fedora-coreos-config" {
      + content      = (sensitive value)
      + id           = (known after apply)
      + pretty_print = true
      + rendered     = (known after apply)
      + snippets     = (sensitive value)
      + strict       = true
    }

  # module.coreos-periphery-vm.proxmox_virtual_environment_file.cloud_user_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "cloud_user_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "0c83b6a3.butane-ci-user-data.ign" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/0c83b6a3.butane-ci-user-data.ign" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = (sensitive value) # forces replacement
          ~ file_name = "0c83b6a3.butane-ci-user-data.ign" -> (known after apply) # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "coreos_vm" {
      ~ id                      = "131" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "192.168.1.235",
            ],
          - [
              - "100.92.48.31",
            ],
          - [
              - "172.17.0.1",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "2600:4808:6170:3a00::248f",
              - "fdfd:3a:a7ff:0:4689:69ce:522b:933c",
              - "2600:4808:6170:3a00:a46b:87f7:949b:4b9c",
              - "fe80::5175:d7df:3f75:ebb8",
            ],
          - [
              - "fd7a:115c:a1e0::101:3020",
              - "fe80::992d:cdd4:78a5:3a3b",
            ],
          - [],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "BC:24:11:EC:30:AA",
          - "00:00:00:00:00:00",
          - "FE:C1:ED:14:3D:13",
        ] -> (known after apply)
      ~ name                    = "coreos-periphery-test" -> (known after apply)
      ~ network_interface_names = [
          - "lo",
          - "ens18",
          - "tailscale0",
          - "docker0",
        ] -> (known after apply)
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 131 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ disk {
          ~ file_format       = "raw" -> (known after apply)
          ~ path_in_datastore = "vm-131-disk-0" -> (known after apply)
            # (13 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          ~ user_data_file_id    = "snippets:snippets/0c83b6a3.butane-ci-user-data.ign" -> (known after apply) # forces replacement
          + vendor_data_file_id  = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:EC:30:AA" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

Plan: 3 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + tailscale_devices = (known after apply)
```
</details>
<!-- placeholder-5 -->
<!-- terraform-35-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->